[
  "input: Buenos días, mi nombre es Carlos García y estoy llamando de empresa. ¿Podría hablar con la señora María Rodríguez? Sí, soy yo. ¿En qué puedo ayudarle? Hola, señora Rodríguez. Le llamo porque hemos notado un saldo pendiente en su cuenta empresa correspondiente al mes pasado. El monto adeudado es de $800 pesos. ¿Le gustaría resolver esto hoy? Oh, sí, lo siento, olvidé hacer el pago. ¿Podría hacerlo ahora mismo por teléfono? Por supuesto, señora Rodríguez. ¿Le gustaría pagar el monto completo o prefiere un plan de pagos? Prefiero hacer el pago completo ahora mismo. Perfecto, puedo ayudarle con eso. Vamos a procesar su pago. ¿Puedo confirmar los detalles de su tarjeta de crédito? Claro, es XXXX-XXXX-XXXX-1234. Gracias, señora Rodríguez. Su pago ha sido procesado con éxito. ¿Hay algo más en lo que pueda asistirla hoy? No, eso es todo por ahora. Gracias por su ayuda. De nada, señora Rodríguez. Que tenga un excelente día. Igualmente. Adiós. Adiós.",
  "output: Agente: Buenos días, mi nombre es Carlos García y estoy llamando de empresa. ¿Podría hablar con la señora María Rodríguez?\nCliente: Sí, soy yo. ¿En qué puedo ayudarle?\nAgente: Hola, señora Rodríguez. Le llamo porque hemos notado un saldo pendiente en su cuenta empresa correspondiente al mes pasado. El monto adeudado es de $800 pesos. ¿Le gustaría resolver esto hoy?\nCliente: Oh, sí, lo siento, olvidé hacer el pago. ¿Podría hacerlo ahora mismo por teléfono?\nAgente: Por supuesto, señora Rodríguez. ¿Le gustaría pagar el monto completo o prefiere un plan de pagos?\nCliente: Prefiero hacer el pago completo ahora mismo.\nAgente: Perfecto, puedo ayudarle con eso. Vamos a procesar su pago. ¿Puedo confirmar los detalles de su tarjeta de crédito?\nCliente: Claro, es XXXX-XXXX-XXXX-1234.\nAgente: Gracias, señora Rodríguez. Su pago ha sido procesado con éxito. ¿Hay algo más en lo que pueda asistirla hoy?\nCliente: No, eso es todo por ahora. Gracias por su ayuda.\nAgente: De nada, señora Rodríguez. Que tenga un excelente día.\nCliente: Igualmente. Adiós.\nAgente: Adiós.\n",
  "input: Buenos días, mi nombre es Laura Martínez y estoy llamando de empresa. ¿Hablo con el señor Juan García? Sí, soy yo. ¿Qué sucede? Señor García, le estamos llamando porque tiene un saldo pendiente de $1,500 pesos en su cuenta empresa del mes pasado. ¿Podría realizar el pago hoy? No puedo pagar todo hoy, ¿hay alguna opción de pago en cuotas? Claro, señor García. Podemos dividir el saldo en tres pagos mensuales de $500 pesos. ¿Le parece bien? Sí, eso estaría bien. Gracias. Perfecto, le enviaré los detalles del plan de pago a su correo electrónico. ¿Hay algo más en lo que pueda ayudarle? No, eso es todo. Gracias por su ayuda. De nada, señor García. Que tenga un buen día. Igualmente. Adiós. Adiós.",
  "output: Agente: Buenos días, mi nombre es Laura Martínez y estoy llamando de empresa. ¿Hablo con el señor Juan García?\nCliente: Sí, soy yo. ¿Qué sucede?\nAgente: Señor García, le estamos llamando porque tiene un saldo pendiente de $1,500 pesos en su cuenta empresa del mes pasado. ¿Podría realizar el pago hoy?\nCliente: No puedo pagar todo hoy, ¿hay alguna opción de pago en cuotas?\nAgente: Claro, señor García. Podemos dividir el saldo en tres pagos mensuales de $500 pesos. ¿Le parece bien?\nCliente: Sí, eso estaría bien. Gracias.\nAgente: Perfecto, le enviaré los detalles del plan de pago a su correo electrónico. ¿Hay algo más en lo que pueda ayudarle?\nCliente: No, eso es todo. Gracias por su ayuda.\nAgente: De nada, señor García. Que tenga un buen día.\nCliente: Igualmente. Adiós.\nAgente: Adiós.\n",
  "input: Hola, mi nombre es Ana López y le hablo de empresa. ¿Puedo hablar con la señora Carmen Sánchez? Sí, soy yo. Señora Sánchez, hemos notado que tiene un saldo pendiente de $1,200 pesos en su cuenta empresa. ¿Podemos resolver esto hoy? Oh, sí, olvidé pagar. ¿Puedo hacer un pago parcial? Claro, podemos establecer un plan de pagos. ¿Le parece bien dividir el monto en cuatro cuotas de $300 pesos cada una? Sí, eso me funciona. Gracias. Perfecto, señora Sánchez. Le enviaré los detalles a su correo electrónico. ¿Hay algo más en lo que pueda asistirla hoy? No, eso es todo. Gracias. De nada, señora Sánchez. Que tenga un buen día. Igualmente. Adiós. Adiós.",
  "output: Agente: Hola, mi nombre es Ana López y le hablo de empresa. ¿Puedo hablar con la señora Carmen Sánchez?\nCliente: Sí, soy yo. ¿Puedo ayudarle?\nAgente: Señora Sánchez, hemos notado que tiene un saldo pendiente de $1,200 pesos en su cuenta empresa. ¿Podemos resolver esto hoy?\nCliente: Oh, sí, olvidé pagar. ¿Puedo hacer un pago parcial?\nAgente: Claro, podemos establecer un plan de pagos. ¿Le parece bien dividir el monto en cuatro cuotas de $300 pesos cada una?\nCliente: Sí, eso me funciona. Gracias.\nAgente: Perfecto, señora Sánchez. Le enviaré los detalles a su correo electrónico. ¿Hay algo más en lo que pueda asistirla hoy?\nCliente: No, eso es todo. Gracias.\nAgente: De nada, señora Sánchez. Que tenga un buen día.\nCliente: Igualmente. Adiós.\nAgente: Adiós.\n",
  "input: Buenos días, soy Javier Torres de empresa. ¿Hablo con el señor Luis Fernández? Sí, soy yo. Señor Fernández, hemos notado un saldo pendiente en su cuenta empresa de $900 pesos. ¿Podría realizar el pago hoy? Lo siento, no puedo pagar todo hoy. ¿Hay alguna opción de pago a plazos? Sí, podemos dividir el saldo en tres cuotas de $300 pesos. ¿Le parece bien? Sí, eso sería perfecto. Gracias. Muy bien, le enviaré los detalles del plan de pago a su correo. ¿Hay algo más en lo que pueda asistirle? No, eso es todo. Gracias. De nada, señor Fernández. Que tenga un buen día. Igualmente. Adiós. Adiós.",
  "output: Agente: Buenos días, soy Javier Torres de empresa. ¿Hablo con el señor Luis Fernández?\nCliente: Sí, soy yo. ¿Qué necesitas?\nAgente: Señor Fernández, hemos notado un saldo pendiente en su cuenta empresa de $900 pesos. ¿Podría realizar el pago hoy?\nCliente: Lo siento, no puedo pagar todo hoy. ¿Hay alguna opción de pago a plazos?\nAgente: Sí, podemos dividir el saldo en tres cuotas de $300 pesos. ¿Le parece bien?\nCliente: Sí, eso sería perfecto. Gracias.\nAgente: Muy bien, le enviaré los detalles del plan de pago a su correo. ¿Hay algo más en lo que pueda asistirle?\nCliente: No, eso es todo. Gracias.\nAgente: De nada, señor Fernández. Que tenga un buen día.\nCliente: Igualmente. Adiós.\nAgente: Adiós.\n",
  "input: Buenos días, mi nombre es Rosa Castillo y estoy llamando de empresa. ¿Puedo hablar con el señor Pedro Martínez? Sí, soy yo. Señor Martínez, le llamo porque tiene un saldo pendiente de $750 pesos en su cuenta empresa. ¿Le gustaría resolver esto hoy? Sí, lo olvidé. ¿Puedo pagar la mitad ahora y la otra mitad el próximo mes? Claro, podemos hacerlo. Le enviaré los detalles de los pagos a su correo electrónico. ¿Le parece bien? Sí, eso suena bien. Gracias. Perfecto, señor Martínez. ¿Hay algo más en lo que pueda ayudarle hoy? No, eso es todo. Gracias. De nada. Que tenga un buen día. Igualmente. Adiós. Adiós.",
  "output: Agente: Buenos días, mi nombre es Rosa Castillo y estoy llamando de empresa. ¿Puedo hablar con el señor Pedro Martínez?\nCliente: Sí, soy yo. ¿Puedo ayudarle?\nAgente: Señor Martínez, le llamo porque tiene un saldo pendiente de $750 pesos en su cuenta empresa. ¿Le gustaría resolver esto hoy?\nCliente: Sí, lo olvidé. ¿Puedo pagar la mitad ahora y la otra mitad el próximo mes?\nAgente: Claro, podemos hacerlo. Le enviaré los detalles de los pagos a su correo electrónico. ¿Le parece bien?\nCliente: Sí, eso suena bien. Gracias.\nAgente: Perfecto, señor Martínez. ¿Hay algo más en lo que pueda ayudarle hoy?\nCliente: No, eso es todo. Gracias.\nAgente: De nada. Que tenga un buen día.\nCliente: Igualmente. Adiós.\nAgente: Adiós.\n",
  "input: Buenos días, soy Roberto Gómez de empresa. ¿Puedo hablar con la señora Laura Ramírez? Sí, soy yo. Señora Ramírez, hemos notado que tiene un saldo pendiente de $1,000 pesos en su cuenta empresa. ¿Podemos resolver esto hoy? Sí, ¿puedo pagar en cuotas? Claro, podemos dividir el monto en cuatro cuotas de $250 pesos. ¿Le parece bien? Sí, eso me sirve. Gracias. Perfecto, le enviaré los detalles del plan de pago a su correo. ¿Hay algo más en lo que pueda asistirla hoy? No, eso es todo. Gracias. De nada, señora Ramírez. Que tenga un buen día. Igualmente. Adiós. Adiós.",
  "output: Agente: Buenos días, soy Roberto Gómez de empresa. ¿Puedo hablar con la señora Laura Ramírez?\nCliente: Sí, soy yo. ¿Qué sucede?\nAgente: Señora Ramírez, hemos notado que tiene un saldo pendiente de $1,000 pesos en su cuenta empresa. ¿Podemos resolver esto hoy?\nCliente: Sí, ¿puedo pagar en cuotas?\nAgente: Claro, podemos dividir el monto en cuatro cuotas de $250 pesos. ¿Le parece bien?\nCliente: Sí, eso me sirve. Gracias.\nAgente: Perfecto, le enviaré los detalles del plan de pago a su correo electrónico. ¿Hay algo más en lo que pueda asistirla hoy?\nCliente: No, eso es todo. Gracias.\nAgente: De nada, señora Ramírez. Que tenga un buen día.\nCliente: Igualmente. Adiós.\nAgente: Adiós.\n",
  "input: Hola, soy Claudia Reyes de empresa. ¿Hablo con el señor Javier López? Sí, soy yo. Señor López, tiene un saldo pendiente de $1,300 pesos en su cuenta empresa. ¿Podemos resolver esto hoy? Lo siento, he tenido problemas financieros. ¿Puedo pagar en partes? Sí, podemos ofrecerle un plan de pagos en tres cuotas de $433.33 pesos cada una. ¿Le parece bien? Sí, eso estaría bien. Gracias. Muy bien, le enviaré los detalles a su correo. ¿Hay algo más en lo que pueda ayudarle? No, eso es todo. Gracias. De nada, señor López. Que tenga un buen día. Igualmente. Adiós. Adiós.",
  "output: Agente: Hola, soy Claudia Reyes de empresa. ¿Hablo con el señor Javier López?\nCliente: Sí, soy yo. ¿Qué necesitas?\nAgente: Señor López, tiene un saldo pendiente de $1,300 pesos en su cuenta empresa. ¿Podemos resolver esto hoy?\nCliente: Lo siento, he tenido problemas financieros. ¿Puedo pagar en partes?\nAgente: Sí, podemos ofrecerle un plan de pagos en tres cuotas de $433.33 pesos cada una. ¿Le parece bien?\nCliente: Sí, eso estaría bien. Gracias.\nAgente: Muy bien, le enviaré los detalles a su correo. ¿Hay algo más en lo que pueda ayudarle?\nCliente: No, eso es todo. Gracias.Agente: De nada, señor López. Que tenga un buen día.Cliente: Igualmente. Adiós.",
  "input: Buenos días, mi nombre es Patricia Hernández y estoy llamando de empresa. ¿Hablo con el señor Ricardo Gómez? Sí, soy yo. Señor Gómez, hemos notado un saldo pendiente de $850 pesos en su cuenta empresa. ¿Le gustaría resolver esto hoy? Sí, lo siento, olvidé pagar. ¿Puedo hacer un pago parcial? Claro, podemos dividir el saldo en dos pagos de $425 pesos. ¿Le parece bien? Sí, eso me funciona. Gracias. Perfecto, le enviaré los detalles a su correo electrónico. ¿Hay algo más en lo que pueda asistirle hoy? No, eso es todo. Gracias. De nada, señor Gómez. Que tenga un buen día. Igualmente. Adiós. Adiós.",
  "output: Agente: Buenos días, mi nombre es Patricia Hernández y estoy llamando de empresa. ¿Hablo con el señor Ricardo Gómez?\nCliente: Sí, soy yo. ¿Puedo ayudarle?\nAgente: Señor Gómez, hemos notado un saldo pendiente de $850 pesos en su cuenta empresa. ¿Le gustaría resolver esto hoy?\nCliente: Sí, lo siento, olvidé pagar. ¿Puedo hacer un pago parcial?\nAgente: Claro, podemos dividir el saldo en dos pagos de $425 pesos. ¿Le parece bien?\nCliente: Sí, eso me funciona. Gracias.\nAgente: Perfecto, le enviaré los detalles a su correo electrónico. ¿Hay algo más en lo que pueda asistirle hoy?\nCliente: No, eso es todo. Gracias.\nAgente: De nada, señor Gómez. Que tenga un buen día."
]